updated readme with mermaid diagrams
